Merge pull request #17 from dfg-agil/feature/reference-model-technical-debt
Translate and streamline model criteria documentation
